# SlabShapeEditor Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RoofBase..::..SlabShapeEditor Property
RoofBase Class See Also
---
Get the SlabShapeEditor used for slab shape editing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public SlabShapeEditor SlabShapeEditor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SlabShapeEditor As SlabShapeEditor
	Get
```

Visual C++
---
```text
public:
property SlabShapeEditor^ SlabShapeEditor {
	SlabShapeEditor^ get ();
}
```

# Remarks
Roofs cannot be attached to another roof, and the roof cannot be a curtain roof. If either of these conditions is not met, the ShapeEditor will be nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
RoofBase Class
Autodesk.Revit.DB Namespace